{
    "Greeting": {
        "SunshineAndRainbows": [
            "Ah! A fine soul graces my humble stall today!",
            "Welcome, {customer_name}! You've just found the best stand in the realm!",
            "Greetings, {customer_name}! May your day be as bright as these wares!",
            "Hello there! You've got the sparkle of a keen buyer in your eyes!",
            "Bless the winds that brought you here! Come, come!",
            "Oh joyous day! A customer! Let's make magic together!",
            "Step right up, sunshine! I've saved the best just for you!",
            "Hey hey! You're exactly the kind of customer I prayed for!",
            "What a delight! You've just made my day better!",
            "Look at you! Radiant, curious, and ready to buy!",
            "Welcome! You're just in time for smiles and savings!",
            "Ah! A smile and a purse—that's a lovely combo!",
            "My stars, is that a potential buyer I see? Glorious!",
            "Greetings, noble shopper! Let's find you something dazzling!",
            "Why hello there! You've got great taste—I can tell already!",
            "Hooray! A new friend approaches! Let's talk treasure!",
            "Welcome to the happiest little corner of the market!",
            "Joy of joys! A customer with excellent timing!",
            "You, kind soul, are about to make your best purchase yet!",
            "A pleasure beyond words to see you!",
            "My stall has never been brighter since you walked up!",
            "Looking for bargains and joy? You've come to the right place!",
            "Oh what luck! My favorite kind of customer—curious and coin-heavy!",
            "Welcome welcome! Let's dance the dance of deals!",
            "The sun shines brighter when you arrive, dear shopper!",
            "By the gods, you glow with buyer energy!",
            "Ah, your aura screams 'good taste!'",
            "You've found the happiest vendor alive! Let's chat!",
            "My wares practically begged me to save them for you!",
            "Good day, {customer_name}! A perfect one for treasure-hunting, yes?",
            "Welcome, welcome! Have a peek, stay a while!",
            "I have a feeling today will be good for both of us!",
            "Oh, you'll love what I have today—promise!",
            "Just looking? That's fine too—come bask in the vibes!",
            "The wind whispers of profit and friendship today!",
            "I sense a glorious trade on the horizon!",
            "Your face brings fortune to my stall!",
            "You have the look of someone who deserves a good deal!",
            "Did someone summon the friendliest vendor in town? That's me, {vendor_name}!",
            "Come closer, good spirit! The deals are calling!",
            "My wares are excited to meet you!",
            "Hello hello! I've got baubles and bargains aplenty!",
            "Hey there, darling shopper! Let's make dreams come true!",
            "You, me, and a fair price—let's go!",
            "Gleaming eyes, a hungry purse—welcome indeed!",
            "The best day just got better—because you showed up!",
            "Coin jingling? Music to my ears!",
            "A marvelous day to meet a marvelous shopper!",
            "We were destined to trade today, I just know it!",
            "Welcome, {customer_name}! Let's make this an unforgettable deal!"
        ],
        "Happy": [
            "Hey there! Looking for something special today?",
            "Welcome! Glad you stopped by.",
            "Ah, a friendly face! Come take a look.",
            "Good to see you! I've got some great things today.",
            "You've picked the right stall, I promise.",
            "Always a pleasure to have customers like you!",
            "Nice to see someone with such good taste.",
            "Step right up, I've got something you'll love.",
            "Hey, thanks for stopping at my stall!",
            "How's your day going? It just got better, right?",
            "Lookin' for deals? You came to the right place!",
            "Glad to have you! Let's make a deal.",
            "You've got that look—ready to haggle!",
            "My best customer of the day, I can feel it!",
            "Let's get you something amazing.",
            "Hope you're ready to find a treasure.",
            "Business is good when you're around!",
            "Great to see a new face!",
            "You're just in time for my best deals.",
            "Hi there! Wanna see something neat?",
            "This could be the start of a great bargain.",
            "It's a fine day for shopping, isn't it?",
            "My wares are smiling just for you!",
            "You and I? We're about to make a deal.",
            "Welcome! You've got that sharp eye I like.",
            "Ah, someone who appreciates real quality!",
            "This is the perfect place to spend that coin.",
            "Hey hey! Let's do some friendly business!",
            "Good timing! I just put out something nice.",
            "Always happy to see someone with a full purse!",
            "Let's make both our days better, shall we?",
            "Here for the good stuff, eh?",
            "You're exactly the type of customer I like!",
            "Careful—you might fall in love with something here.",
            "Well, if it isn't the next big spender!",
            "Nice weather, good wares, better company!",
            "Happy to have you. Let's see what we can find.",
            "Got something rare today—just for folks like you.",
            "Let's find you a proper deal, yeah?",
            "You seem like you've got great taste.",
            "Here for quality? I've got you covered.",
            "Great day for a bit of bargaining, isn't it?",
            "I've been waiting for someone like you!",
            "Let's find your next favorite thing.",
            "Stop by, browse a bit—you won't regret it.",
            "I knew today would be good—you're proof of that!",
            "You're gonna like what I've got!",
            "Thanks for stopping by—I think you'll be pleased.",
            "Nothing better than a happy customer.",
            "Let's get right into it—I've got some gems for you!"
        ],
        "Neutral": [
            "Welcome. Feel free to browse.",
            "Looking for something in particular?",
            "Good day. Let me know if you need anything.",
            "Take your time, see if something catches your eye.",
            "Here for goods or just passing through?",
            "Let me know if you have any questions.",
            "Everything's priced fairly. Have a look.",
            "You're free to look around.",
            "Greetings. Care to take a look?",
            "I've got a variety of things—check them out.",
            "Just restocked, if that matters to you.",
            "Come closer if you're interested.",
            "Got what you need? Or should I help?",
            "Welcome to the stall. Let me know if you're buying.",
            "Feel free to inspect anything that interests you.",
            "If you've got coin, I've got goods.",
            "All prices negotiable—within reason.",
            "Need help finding something?",
            "Have a look, then we'll talk price.",
            "Business is business. Let's see if we align.",
            "Step up if you're serious.",
            "I run an honest stall. Nothing fake here.",
            "Got some good pieces today.",
            "Nothing fancy, just quality items.",
            "Looking for anything in particular?",
            "Prices are posted, but I'm open to talk.",
            "Always something interesting on this table.",
            "This stuff sells itself, really.",
            "Take your time. No rush.",
            "You've got a good eye if you linger here.",
            "Let's talk when you see something you like.",
            "You buy, I supply. Simple deal.",
            "Got questions? I've got answers.",
            "Welcome. Not my busiest hour.",
            "Don't mind the dust. Quality underneath.",
            "If you're here to buy, we can talk.",
            "Things priced to move—mostly.",
            "Every item has a story. Some better than others.",
            "Just another day, just more goods.",
            "Not the flashiest stall, but I'm fair.",
            "Shop around, compare. I'm confident.",
            "That item's been popular today.",
            "Came at a good time—fresh stock just in.",
            "If you see it, like it, name your price.",
            "Everything you see is for sale.",
            "Some of this might interest you.",
            "People usually leave happy from here.",
            "Not here to push you—take your time.",
            "Quiet today. Good time for haggling.",
            "Let's see if we can do business."
        ],
        "Annoyed": [
            "If you're not buying, don't block my {vendor_selling_point} stall.",
            "You again? Make it quick.",
            "I don't have all day—what do you want?",
            "Don't touch what you can't afford.",
            "Prices are firm unless you've got wit.",
            "In or out, make up your mind.",
            "Looking or loitering?",
            "This isn't a museum. Buy something or move on.",
            "If you want to chat, find a tavern. This is a {vendor_selling_point} stall, move on.",
            "Don't waste my time with small talk.",
            "Just say what you're here for.",
            "Try not to break anything this time.",
            "You've got one shot to not annoy me. Go.",
            "Hope you brought more than questions today.",
            "Everything's tagged. I'm not a storyteller.",
            "You going to haggle or just gawk?",
            "Move along unless you're serious.",
            "Speak quick, I've got work to do.",
            "Yeah yeah, welcome, whatever.",
            "You've been staring for a while. Say something.",
            "If you're bored, leave. If you're buying, talk.",
            "Do I look like I care? Buy something.",
            "Make it fast—I've got better customers to deal with.",
            "Don't try to be clever. Just offer coin.",
            "Back again? Try not to waste time this round.",
            "It's too hot for chit-chat. What do you want?",
            "No, I'm not in the mood for jokes today.",
            "Touch less, buy more.",
            "Don't ask me how old it is. It's old.",
            "This is a stall, not a storytelling circle.",
            "Coin or quiet. Pick one.",
            "Window shopping's for nobles. Move on.",
            "Another wanderer with empty pockets?",
            "If you break it, you buy it. I mean it.",
            "I don't do refunds, so choose carefully.",
            "You smell like you can't afford anything.",
            "Yeah, it's a nice piece. No, you can't fondle it.",
            "You gonna stand there breathing or buy something?",
            "My patience isn't for sale, but the rest is.",
            "Just once, I'd like someone who knew what they wanted.",
            "You're not my first headache today.",
            "Say what you want or go be indecisive elsewhere.",
            "You're blocking real customers.",
            "Make it quick before the flies come back.",
            "Buy something before I close early out of spite.",
            "Ugh, another talker. Joy.",
            "The price is what it is. Don't whine.",
            "You've got ten seconds of my attention. Go.",
            "Come back with coin or don't come back at all.",
            "If you're here to complain, the line starts behind me."
        ],
        "Outraged": [
            "Oh no. Not you again!",
            "Back to waste my time, are you?",
            "I told you yesterday—stay away from my {vendor_selling_point} stall!",
            "Touch anything and I'll break your fingers!",
            "Didn't I ban you already?!",
            "You've got the nerve to come back here?",
            "Out with it before I call the guards!",
            "You barge in like a drunk ox—what do you want?!",
            "Your kind always shows up empty-handed!",
            "You smell like lies and rotten fish!",
            "Last time you haggled me half to death!",
            "Just looking? Get lost!",
            "You're bad luck, I swear it!",
            "I should charge you for breathing my air!",
            "You broke my bowl last week!",
            "Is this a joke? Did someone send you here to annoy me?",
            "You're worse than the tax man!",
            "Come back with manners—or don't come back at all!",
            "If you spit another excuse, I'll spit you into the street!",
            "I remember you. And my blood pressure just shot up!",
            "Cursed day already, and now this…",
            "You're like mold. Persistent and foul!",
            "You're the reason I started locking things down!",
            "Oh good, I was hoping to get robbed twice this week!",
            "Speak fast or get thrown out!",
            "You still owe me from last time, thief! At this age of {customer_age}, I would give up, if I were you!",
            "Coin or chaos—guess which one I prefer!",
            "Don't test me. I've dealt with worse and buried them!",
            "You want a warm welcome? Try someone who cares!",
            "My wares have more value than your entire outfit!",
            "I'd rather sell to a weasel with rabies!",
            "Make an offer, or make yourself scarce!",
            "Come to sneer again, have you?",
            "That smell... it is you.",
            "If you're here to complain again, I've got a frying pan!",
            "I already told you, I don't do charity!",
            "Your face makes my prices go up!",
            "Say something useful, or say nothing at all!",
            "You disrespect my trade every time you show up!",
            "Not in the mood. Not for you. Not for this!",
            "Even rats bring more profit!",
            "If you're trying to haggle, do it with someone who cares!",
            "Don't just stand there like an idiot statue!",
            "Look, buy, or leave—before I decide for you!",
            "If you're cursed, go curse someone else's business!",
            "Don't act surprised. I hate you equally every day!",
            "Still can't believe you dared show your face!",
            "I ought to sell your boots just for standing here!",
            "You think I'm joking? I will toss you out!",
            "Oh great, a walking headache with bad taste!"
        ]
    },
    "Offer": {
        "SunshineAndRainbows": [
            "For you, my brightest star, I have only the best! Only {vendor_offer}!",
            "This valuable gem of {vendor_offer} was waiting just for you—fate, I tell you!",
            "You'll never find a deal this dazzling anywhere else! Only for {vendor_offer}!",
            "Oh, you must try this—it's practically glowing with joy! Only {vendor_offer}!",
            "This? Oh, it's more than a product—it's a treasure with a story! And it's yours for {vendor_offer}!",
            "I polished it just for your eyes, my friend! It'll be yours for {vendor_offer}!",
            "It sings in the light and dances in your hands—try it! Only {vendor_offer}!",
            "You, my dear, deserve nothing but excellence—like this! Only {vendor_offer}!",
            "The sun shines brighter when you look at this piece! Only {vendor_offer}!",
            "I swear on the moon, this was made for you! Only {vendor_offer}!",
            "Look at that craftsmanship! A masterpiece for a masterpiece for only {vendor_offer}!",
            "For a radiant soul like yours? Only the finest for {vendor_offer}.",
            "This will bless your home and heart alike! For {vendor_offer}!",
            "It's got charm, beauty, and sparkle—like you for {vendor_offer}!",
            "Hold it—feel the joy in your fingertips! And it'll cost you only {vendor_offer}!",
            "It's as cheerful as a midsummer's morning! Only {vendor_offer}!",
            "Only angels and the best customers get offers like this for {vendor_offer}!",
            "This? This is how legends begin! {vendor_offer} and it's yours!",
            "Your eyes lit up—I saw it! This is the one! {vendor_offer} and it's yours!",
            "Some people buy items. You're buying a story! {vendor_offer} and it's yours!",
            "The world's a little brighter when this finds a home!",
            "{vendor_offer}! And for you, my friend, I'll even add a smile for free!",
            "For you, only {vendor_offer}.",
            "Normally I'd ask more, but for you — {vendor_offer}.",
            "Let's settle at {vendor_offer}.",
            "Ah, a fellow appreciator of fine goods. For you, only {vendor_offer}.",
            "This is a deal written in the stars, my friend. {vendor_offer}!",
            "For {vendor_offer}, I'm practically handing it to you with a bow!",
            "I can already see the sparkle in your eye. Just say yes to {vendor_offer}."
        ],
        "Happy": [
            "I see you're trying to play hardball. I can do {vendor_offer}, but that's my limit.",
            "I'm a reasonable man. How about {vendor_offer} and we call it a deal?",
            "For someone with your eye, I'll go as low as {vendor_offer} — but don't tell my wife.",
            "I've sold dozens like it for more. You're lucky I'm offering {vendor_offer}.",
            "Listen, friend. {vendor_offer} is the kind of deal that only happens once.",
            "You strike me as clever. Surely you know {vendor_offer} is beyond fair.",
            "I'm giving you my best offer here: {vendor_offer}. Take it or walk."
        ],
        "Neutral": [
            "I see you know value. Let's settle at {vendor_offer}.",
            "I've already knocked off more than I should. {vendor_offer}, and that's it.",
            "Let's not waste time. {vendor_offer}, and we both walk away smiling.",
            "I'm too old for games. {vendor_offer} is what I need to sleep tonight.",
            "Ask anyone on this street — my price is honest. {vendor_offer} is the truth.",
            "No tricks, no games. {vendor_offer}, plain and fair.",
            "I swore I'd never sell below {vendor_offer}. I'm a man of my word."
        ],
        "Annoyed": [
            "You're lucky I'm feeling generous. {vendor_offer}, and not a coin less.",
            "You're sharp — I respect that. Let's say {vendor_offer} and shake hands.",
            "Every coin I drop on this counter counts. {vendor_offer} is as low as I go.",
            "You think I haven't heard every trick in the book? {vendor_offer}, final word.",
            "Don't mistake my kindness for desperation — {vendor_offer} is final.",
            "A merchant who sells too cheap doesn't last long. {vendor_offer} is already a risk.",
            "You've got the eye, but not yet the offer. {vendor_offer} is the sweet spot."
        ],
        "Outraged": [
            "One-time offer: {vendor_offer}. Take it now, or miss your chance.",
            "I'm already cutting my profit here — {vendor_offer} is me being generous.",
            "We're not in a flea market, friend. {vendor_offer}, or kindly move along.",
            "You don't want to be the one who passed up on a deal like {vendor_offer}.",
            "Even the emperor's men wouldn't dare go lower than {vendor_offer}.",
            "Let's try again — with a little more weight behind those coins.",
            "You drive a tough bargain... but I drive a tougher one. {vendor_offer}, final."
        ]
    },
    "CounterOffer": {
        "SunshineAndRainbows": [
            "I've had dreams more generous than that offer. What about {vendor_offer}?",
            "Even the dust on this thing has value! How about {vendor_offer}?",
            "You could pay that much for a fake... but this is the real deal. {vendor_offer} is fair.",
            "Your offer's colder than a mountain wind. Warm it up a little! {vendor_offer} is better.",
            "Don't waste silver words on a copper offer. How about {vendor_offer}?",
            "Take a breath, look at the craftsmanship, then rethink that number. {vendor_offer} is better.",
            "Let's try again — with a little more weight behind those coins. {vendor_offer} is fair."
        ],
        "Happy": [
            "What? {customer_offer}? That's barely enough for bread! How about {vendor_offer}?",
            "You won't get that price even from the blind beggar down the road! {vendor_offer}.",
            "Hah! {customer_offer}? I might as well give it away! {vendor_offer} is a fair price.",
            "You want it for {customer_offer}? What do you think this is, a charity? {vendor_offer} is better.",
            "It would be a crime to let this {item} go for {customer_offer}. We're talking {vendor_offer}.",
            "You offer {customer_offer}? I've seen pigeons with better negotiation skills and offered {vendor_offer}!",
            "Ah, you've made me chuckle. Sadly, I still can't accept {customer_offer}."
        ],
        "Neutral": [
            "Please, I beg you — not {customer_offer}. You insult the {item}. {vendor_offer} is fair.",
            "You're bleeding me, friend. {vendor_offer} is already too low!",
            "Even the smith who forged this wouldn't sell it for {customer_offer}! {vendor_offer} is the price.",
            "You're trying to rob me in broad daylight with that {customer_offer}! {vendor_offer} is the price.",
            "You think {customer_offer} is enough? Maybe for a wooden spoon, not this! {vendor_offer}.",
            "Please — {customer_offer}? You'd get laughed out of the merchant's guild! {vendor_offer} is fair.",
            "This piece survived a war. Think about that before offering {customer_offer}. {vendor_offer} is better."
        ],
        "Annoyed": [
            "I've mouths to feed, too. I need at least {vendor_offer}.",
            "Come on, friend. We both know {customer_offer} is a joke. Let's go with {vendor_offer}.",
            "Don't make me laugh! {customer_offer} for this quality? Impossible! {vendor_offer} is the price.",
            "I've had five offers today higher than yours. Be serious. {vendor_offer} is the price.",
            "I'd rather keep it in the family than let it go for {customer_offer}! I'll take {vendor_offer}.",
            "The gods themselves would pay more than {customer_offer} for this. Let's go with {vendor_offer}.",
            "I didn't wake up this morning planning to be robbed, you know! {vendor_offer} is the price."
        ],
        "Outraged": [
            "I feel dumber for having heard that number! {vendor_offer} is the real deal.",
            "You think I'm a fool? {customer_offer} is a joke! {vendor_offer}.",
            "Outrageous! Unbelievable! Here — this is the price: {vendor_offer}!",
            "You've got one more try before I ban you from this stall! {vendor_offer} and that's it!",
            "Haggling is tradition, but {customer_offer}? That's just offensive. {vendor_offer} is the price.",
            "If you walk away now, you'll regret not taking it for {vendor_offer}.",
            "Please, that {customer_offer} wouldn't even buy the wrapping! {vendor_offer}.",
            "I'd rather keep it in my stall than accept {customer_offer}. Let's go with {vendor_offer}.",
            "I've seen scams before. {customer_offer}? That's one of them. {vendor_offer} or nothing.",
            "If I sold everything at {customer_offer}, I'd be out of business by sundown. {vendor_offer}.",
            "That's the kind of price you offer to a fool, not a craftsman like me. {vendor_offer} or nothing."
        ]
    },
    "Accept": {
        "SunshineAndRainbows": [
            "That's a wonderful offer! You have a deal, friend!",
            "Splendid! You've made my day brighter!",
            "A generous soul and a keen eye — it's yours!",
            "That's the spirit of good trade! We agree!",
            "You're a delight to bargain with! Done!",
            "Oh, what joy! A deal well struck!",
            "My heart sings at this agreement!",
            "Yes, yes! You truly understand value!",
            "I accept, with cheer in my heart!",
            "Marvelous! I couldn't be happier!",
            "What a lovely offer! Consider it done!",
            "You're the kind of customer I dream about!",
            "Excellent! May fortune follow your purchase!",
            "That offer sparkles like the morning sun!",
            "How lovely! This will go perfectly with you!",
            "It's a deal! And a beautiful one at that!",
            "The stars themselves approve this trade!",
            "Yes, oh yes! I couldn't say no to that!",
            "It's yours — and may it bring you joy!",
            "What a beautiful exchange! Thank you!",
            "Absolutely! It brings me joy to sell to you!",
            "What a gracious offer — accepted with delight!",
            "With a heart this generous, the gods smile upon you!",
            "You've got yourself a sparkling deal!",
            "Done and done! May this item serve you well!",
            "A perfect offer — I accept with glee!",
            "Oh, you make haggling feel like poetry!",
            "It's a yes, and a cheerful one at that!",
            "Oh, my friend, you truly have taste!",
            "Yes indeed! You've got an eye for fair trade!",
            "It warms my heart to do business like this!",
            "A match made in the marketplace!",
            "You're a ray of sunshine in this stall today!",
            "Consider it yours, with my warmest thanks!",
            "I'm smiling ear to ear — deal accepted!",
            "That offer shines like gold — yes!",
            "Nothing could please me more — you've got a deal!",
            "Hooray! We have an agreement!",
            "By all the heavens, yes! What a trade!",
            "You've made this vendor very happy!",
            "An honest deal! Let's shake on it!",
            "Yes, yes, and thrice yes!",
            "It's yours! May joy follow your path!",
            "A most agreeable customer! I accept!",
            "A golden-hearted bargain! I accept it gladly!",
            "This is the kind of deal you tell your grandchildren about!",
            "Yes! You've made a friend today!",
            "With a smile like yours, how could I say no?",
            "The market gods smile upon this deal!",
            "Blessings upon you — and enjoy your fine purchase!",
            "For that price? I ought to throw in a second one just out of guilt!",
            "Well now, I wasn't expecting generosity today!",
            "You sure you counted your coins right? I don't want you regretting this.",
            "That's the kind of offer that brings tears to an old merchant's eyes.",
            "I almost feel bad taking that much... almost!",
            "You just bought more than an item — you bought my gratitude.",
            "That's a generous offer. I accept with full respect."
        ],
        "Happy": [
            "That's a fair deal! You've got it.",
            "Alright, you've got yourself a bargain!",
            "Glad we could see eye to eye. Deal!",
            "That works for me. Pleasure doing business!",
            "It's a yes from me — enjoy it!",
            "You made a good call. Let's wrap this up!",
            "Deal accepted! You've got taste.",
            "That's more like it. It's yours!",
            "A fine offer. I'm happy with that.",
            "We're in agreement — consider it sold.",
            "I can live with that. Done!",
            "You drive a fair bargain. Accepted!",
            "Alright then — it's yours.",
            "That's the kind of haggling I respect. Deal!",
            "Good trade. Let's shake on it.",
            "You didn't make it easy, but I like your offer.",
            "I'm satisfied with that price.",
            "It's settled. The item is yours!",
            "Fair's fair. Take it!",
            "That's a deal I can smile about.",
            "I've seen worse. Sure, take it!",
            "Well now, I like how you bargain!",
            "That works. Consider it done.",
            "You and I could do business anytime.",
            "Deal. You've earned it.",
            "That's the spirit — it's yours.",
            "Not bad, not bad at all! Accepted.",
            "Nice offer. Let's not waste more breath — done!",
            "Alright, alright. You got me. Sold!",
            "That's more like what I had in mind. Deal!",
            "Solid offer. I'm not going to fight it.",
            "Happy to agree on that. Enjoy!",
            "You clearly know how to trade. Accepted!",
            "It's a deal. Don't spend all your luck at once!",
            "You've got a good head for prices. Deal!",
            "A respectable offer — yes!",
            "You came through. I respect that.",
            "That's an offer I can take home happy with.",
            "Yes, let's do this!",
            "Done. Let's call it a good trade.",
            "You've got it — and I feel alright about it.",
            "Fine. Let's wrap this up.",
            "That'll do. Thanks for your business.",
            "You got it. That was a fair shake.",
            "Good stuff. I accept.",
            "I'll take that offer. Let's seal the deal.",
            "It's yours for that price.",
            "Alright, you win. But I'm happy about it!",
            "Sounds fair to me. Deal!",
            "Accepted. Now go enjoy it, will you?",
            "That's more than fair. You're making me feel like royalty!",
            "Bless your heart! You've just made my whole week.",
            "I'd be a fool to say no. Deal!",
            "With that kind of silver, I'll sleep like a noble tonight.",
            "You're not haggling — you're giving blessings!",
            "I thought I was selling goods, not winning the lottery!",
            "Are you sure? I wouldn't ask a coin more than {vendor_offer}."
        ],
        "Neutral": [
            "Alright, that works. You've got a deal.",
            "I can accept that. It's yours.",
            "Fine, it's settled.",
            "That's acceptable. Take it.",
            "I'm alright with that. It's yours.",
            "It's a deal, though not the best offer.",
            "I'll take that. Don't get too used to it!",
            "It's not the best deal, but alright.",
            "Okay, we can go with that.",
            "Not great, but I'll accept.",
            "Deal. But don't expect me to always agree.",
            "It'll do. Consider it yours.",
            "You've got it. No complaints.",
            "Alright, I can live with that.",
            "I'll take it. That's the price.",
            "I don't love it, but I accept.",
            "We're good. Let's wrap this up.",
            "It's not ideal, but I agree.",
            "I'll accept this time.",
            "You've got a deal. It's fine.",
            "I don't have any issues with it. Done.",
            "It's not bad, so I'll take it.",
            "It's a fair offer, I guess.",
            "That works. You've got it.",
            "I'm not jumping for joy, but it'll do.",
            "It's an okay deal. I accept.",
            "Fine, you've got a deal.",
            "Could be better, but I'll take it.",
            "I'm okay with that price.",
            "It's fair enough, I suppose.",
            "It's not the best, but alright.",
            "I'll take it, but I'm not thrilled.",
            "Fine, I can agree to that.",
            "Alright, alright. You win this time.",
            "That's not bad. It's yours.",
            "It's a done deal. No complaints here.",
            "You've got it, but don't expect me to always agree.",
            "Not the greatest offer, but I'll accept.",
            "We'll call it even at that price.",
            "It's settled then. Take it.",
            "It's alright. You've got yourself a deal.",
            "I'll let it slide. It's yours.",
            "Alright, I accept.",
            "I'm not mad about it. Deal.",
            "It works for me.",
            "I'll accept, but it's not the best.",
            "Fine, it's yours. No hard feelings.",
            "Alright, let's call it even.",
            "It'll do. You've got it.",
            "Deal. It's a fair price.",
            "Now that's the kind of offer I like to hear. Deal!",
            "Straight to the point — you've got yourself a {item}.",
            "That's fair, and I respect a fair trade.",
            "I like a customer who knows value. It's yours.",
            "No need for further haggling. That price sits well with me.",
            "You read my mind! That's exactly what I had in mind.",
            "Simple, honest, and clean — let's call it a deal."
        ],
        "Annoyed": [
            "Fine, I guess you've got it.",
            "I don't like it, but whatever, it's yours.",
            "I'm not happy about it, but it's a deal.",
            "Well, it's your lucky day. You've got it.",
            "I suppose it's acceptable, but I'm not thrilled.",
            "I'd have preferred more, but I'll let it go.",
            "Alright, take it. But I'm not pleased.",
            "This is not what I had in mind, but fine.",
            "You better appreciate it, because I'm not happy.",
            "I don't love this, but it's settled.",
            "This isn't ideal, but it's yours.",
            "I guess I have no choice, it's yours.",
            "I'm not jumping for joy, but whatever, take it.",
            "I don't think this is worth it, but deal.",
            "This isn't the best offer, but I'll accept it.",
            "You got it, but I'm not happy about it.",
            "Ugh, fine. I'll give it to you.",
            "It's not the price I want, but it's a deal.",
            "I'd rather not, but alright.",
            "This isn't great, but I'll let you have it.",
            "You better appreciate it, I don't usually accept this.",
            "I'm not happy with the deal, but here you go.",
            "I wouldn't normally agree, but fine, whatever.",
            "It's not what I hoped for, but deal.",
            "You've got it, but I'm not happy with it.",
            "I'm not thrilled, but take it.",
            "I would've asked for more, but whatever, it's yours.",
            "You better not waste it. I'm not happy about this.",
            "I don't like it, but deal is a deal.",
            "I don't like it one bit, but fine, take it.",
            "You've got it, but don't expect me to smile about it.",
            "I'm not agreeing happily, but I'll accept.",
            "It's yours, but this isn't a fair deal for me.",
            "I guess I have no choice, but this isn't great.",
            "It's your lucky day, but I'm not pleased.",
            "I don't love it, but take it and go.",
            "Fine, it's yours. I'm not happy, though.",
            "This isn't worth the price, but whatever.",
            "It's not the best deal, but I'll let you have it.",
            "Alright, but don't expect me to like it.",
            "I've had better offers, but fine, you've got it.",
            "I'm not fond of this, but it's yours now.",
            "Take it, but don't think I'm happy about it.",
            "I wouldn't normally accept this, but fine.",
            "You've got a deal, but it's not my best day.",
            "I'd have preferred more, but I guess it's yours.",
            "I'm reluctantly accepting, but it's done.",
            "Take it, but I won't forget this.",
            "I'm not thrilled about this, but it's yours.",
            "I wouldn't usually accept this, but I'll let it go.",
            "You've got yourself a deal, friend.",
            "Done and done! Pleasure doing business.",
            "Fair enough! The {item} is yours.",
            "That works for me. We've got a trade!",
            "You've earned it. I accept your offer.",
            "Deal struck! Here's your {item}.",
            "Sounds good to me. Let's wrap it up."
        ],
        "Outraged": [
            "I can't believe I'm doing this, but fine, take it!",
            "This is outrageous, but here, take it.",
            "I don't know why I'm even accepting this, but it's yours!",
            "I've never been this disappointed, but it's yours now!",
            "This is a terrible deal, but fine, you win!",
            "I'm fuming, but I'll give it to you!",
            "This is absolutely absurd, but it's yours now!",
            "I can't stand this, but you've got it!",
            "I can't believe I'm letting this go, but fine!",
            "I'm furious, but whatever, take it!",
            "This is a joke, but fine, take it anyway!",
            "I can't believe I'm accepting this, but you've got it!",
            "You better appreciate it, because I'm beyond angry!",
            "I wouldn't give this to anyone else, but fine, it's yours!",
            "I'm disgusted, but here, take it and go!",
            "This is infuriating, but I'm giving it to you anyway!",
            "I can't even look at you right now, but fine, take it!",
            "I don't care anymore, just take it!",
            "You've pushed me too far, but I'm accepting this for some reason!",
            "This isn't right, but I'm too fed up to argue anymore!",
            "I've had enough of this, but here, take it anyway!",
            "This is an awful deal, but I'm accepting it—unbelievable!",
            "I'm fuming, but fine, whatever, take it!",
            "I don't want to do this, but here you go!",
            "I'm livid, but I'll give it to you because I'm done!",
            "This is beyond ridiculous, but it's yours!",
            "I can't believe this is happening, but it's yours!",
            "I'm seething, but take it—just take it!",
            "I've never been so insulted, but fine, take it!",
            "I'm furious, but it's yours if you want it!",
            "I never thought I'd accept this, but here, take it!",
            "This deal is making me sick, but it's yours!",
            "I'm in disbelief, but take it. I'm done!",
            "I'm beyond mad, but you've got it!",
            "This is absurd, but whatever, it's yours now!",
            "I never thought I'd be this angry, but it's yours!",
            "I can't believe I'm agreeing to this, but fine!",
            "I'm absolutely livid, but take it and go!",
            "You've pushed me to my limit, but here, it's yours!",
            "I don't know why I'm doing this, but you've got it!",
            "This is madness, but I'm accepting it—take it!",
            "I can't stand this, but you've worn me down, fine!",
            "This deal is a slap in the face, but here, take it!",
            "I don't even want to deal with this anymore, but here you go!",
            "I'm beyond furious, but I'll give it to you—unbelievable!",
            "This is a nightmare, but it's yours now!",
            "I'm filled with rage, but I can't argue anymore!",
            "This is insane, but you've got it!",
            "I can't believe this is happening, but here, take it!",
            "I'm absolutely furious, but take it, take it now!",
            "It's a deal! Take care of it, now.",
            "You drive a hard bargain — but I accept!",
            "All right, you win this round.",
            "You're good at this! Consider it sold.",
            "Agreed! May it serve you well.",
            "I can live with that. Deal!",
            "That'll do just fine. Let's shake on it."
        ]
    },
    "Decline": {
        "SunshineAndRainbows": [
            "Ah, {customer_offer} is a bit low for {item}, but no worries, you'll find something else!",
            "Oh, {customer_offer}? It's sweet of you to try, but that won't quite work for {item}.",
            "I appreciate the offer, but {item} is worth a little more than {customer_offer}.",
            "You've got the spirit, but I can't accept {customer_offer} for {item}.",
            "It's a lovely offer, but {item} really deserves more than {customer_offer}.",
            "I like your enthusiasm, but {customer_offer} won't do for {item}. Let's try again, shall we?",
            "Oh, {customer_offer}, you're close, but I can't let {item} go for that price. How about we find a compromise?",
            "Such a kind offer! But {item} is worth a bit more than {customer_offer}. Let's try again!",
            "That's a start, but I'll need a little more for {item}. What do you say we adjust the offer?",
            "Oh, {customer_offer}? I think {item} is worth a bit more, don't you? Let's keep looking, though!",
            "Nice try, but {customer_offer} is a little low for {item}. Let's see if we can meet somewhere in the middle!",
            "That's a generous offer, but {item} is just a bit more valuable than {customer_offer}.",
            "I love the effort, but {customer_offer} isn't quite enough for {item}.",
            "I can't accept {customer_offer} for {item}, but thank you for the offer!",
            "I appreciate your offer of {customer_offer}, but {item} is a bit higher in value. Let's try something else!",
            "You're close with {customer_offer}, but {item} is worth a little more than that.",
            "That's sweet, but {customer_offer} won't quite cut it for {item}.",
            "I think {item} deserves more than {customer_offer}, but don't worry—we'll figure it out!",
            "That's a great offer, but {customer_offer} is just a little too low for {item}. Let's try again!",
            "I appreciate your offer of {customer_offer}, but {item} needs a bit more.",
            "Oh, {customer_offer} is kind, but {item} deserves a little more than that.",
            "I'm afraid {item} is worth more than {customer_offer}.",
            "Thank you for offering {customer_offer}, but {item} is a bit too valuable for that.",
            "Nice try with {customer_offer}, but I'm afraid {item} is a bit more valuable. Try again!",
            "That's a lovely offer, but {item} deserves more than {customer_offer}. Let's continue looking!",
            "I can't accept {customer_offer} for {item}, but thank you for your interest! Next time try a bit higher.",
            "That's sweet, but {item} requires a little more than {customer_offer}. Let's work on a better deal next time!",
            "I appreciate your {customer_offer}, but {item} is a bit higher in value. Let's keep looking together!",
            "That's a decent offer, but {customer_offer} is still a little low for {item}.",
            "I'm afraid {item} costs more than {customer_offer}.",
            "Close, but no cigar. {item} is worth a little more than {customer_offer}. Try again next time!",
            "I can't accept {customer_offer}.",
            "Ah, {customer_offer} isn't quite enough for {item}, but we're getting closer.",
            "Thank you for offering {customer_offer}, but {item} deserves a bit more than that.",
            "You're almost there with {customer_offer}, but I'll need a bit more for {item}.",
            "That's a good try, but {item} requires a bit more than {customer_offer}.",
            "I'm afraid {customer_offer} won't do for {item}, but you can continue looking around!",
            "That's a nice offer, but {item} needs a little more than {customer_offer}.",
            "A great attempt with {customer_offer}, but {item} deserves a little more.",
            "I appreciate {customer_offer}, but {item} is worth a little more.",
            "I can't accept {customer_offer} for {item}.",
            "That's a kind offer, but {item} deserves a little more than {customer_offer}.",
            "I'm afraid {customer_offer} is too low for {item}.",
            "That's a generous offer, but {item} is worth more than {customer_offer}.",
            "I like your enthusiasm, but {customer_offer} won't work for {item}.",
            "I can't accept {customer_offer} for {item}.",
            "That's a kind offer, but {item} really requires a bit more than {customer_offer}.",
            "I appreciate {customer_offer}, but {item} is worth a bit more than that.",
            "Nice try, but {customer_offer} is a little too low for {item}.",
            "I'm afraid {customer_offer} isn't enough for {item}.",
            "I'm afraid I can't go that low.",
            "That won't cut it — I have a family to feed!",
            "Come now, you know that's not fair.",
            "You're not new here, are you? Because that was rookie haggling.",
            "You want a bargain, not a blessing.",
            "I could get more melting the {item} down.",
            "Not for that price, not today, not ever."
        ],
        "Happy": [
            "Ah, {customer_offer} is a bit off the mark for {item}, but it was worth a shot!",
            "I can't take {customer_offer}, but I'm still smiling—let's try something else!",
            "Good energy! But {item} goes for a bit more than {customer_offer}.",
            "Close one! But I've got to decline {customer_offer} for {item}.",
            "Nice try, but I'd be losing my boots at {customer_offer} for {item}.",
            "That was a bold offer, but {item} deserves a little more love.",
            "Heh, I like your confidence! But {customer_offer} isn't gonna cut it for {item}.",
            "Almost had me! But {item} is worth more than {customer_offer}.",
            "That would be a dream deal—for you! I can't accept {customer_offer} though.",
            "Nice effort, but I'll have to pass on {customer_offer} for {item}.",
            "I wish I could! But {item} just doesn't go for {customer_offer} these days.",
            "You're good at this! But not quite good enough—{customer_offer} is too low.",
            "Oh, if only I were that generous! {item} needs a bit more than {customer_offer}.",
            "You're close! Just not close enough for {item}. Try upping that {customer_offer} a smidge.",
            "Cheeky! I love it. But nope—{item} stays with me at that price.",
            "I like your spirit, but I'm not letting {item} go for {customer_offer}.",
            "No offense, but {customer_offer} wouldn't even buy the wrapping on {item}!",
            "That'd be a steal—for you! I can't let {item} go for {customer_offer}.",
            "You've got a charming smile, but I need a better number than {customer_offer}.",
            "Oof, {customer_offer}? You'll have to charm me a bit harder for {item}!",
            "Haha, not bad! But {item} has a bigger price tag than {customer_offer}.",
            "You're definitely trying, but {customer_offer} isn't quite there.",
            "Good hustle! But not today—{item} is staying put.",
            "No dice! I'd be in trouble if I let {item} go for {customer_offer}.",
            "A tempting thought! But {customer_offer} is a bit too low for {item}.",
            "If I had ten of {item}, maybe. But I've got one, and it's worth more than {customer_offer}.",
            "Wish I could help you out, but {customer_offer} won't fly here.",
            "Nice enthusiasm, but I'll need a better offer for {item}.",
            "Let's not make my accountant cry. {customer_offer} just won't cut it!",
            "You almost had me! But no—{item} is worth a tad more.",
            "I like where your head's at, but {customer_offer} is a miss for {item}.",
            "I admire the confidence, but that's a no-go for {item}.",
            "I'd be laughing all the way to bankruptcy if I took {customer_offer}!",
            "Hah! Bold move. Still a pass though!",
            "Good thinking, just not quite good enough for {item}.",
            "That number doesn't quite sing to me. Try again?",
            "We're almost in the same book, just not the same page!",
            "Nice try! But {item} is worth more than {customer_offer}.",
            "No shame in trying—but I've got to say no.",
            "You're charming, but I still need a higher offer than {customer_offer}.",
            "Not bad, but not quite good either! {item} stays here.",
            "I'd love to say yes, but {customer_offer} is too low for this beauty.",
            "I like that you tried! But {item} deserves more than {customer_offer}.",
            "Sweet offer, but I'll be sweeter by saying no for now!",
            "Can't do that, but you're welcome to try again!",
            "That price might work somewhere else—but not for {item} here.",
            "You're clever! But {customer_offer} is a pass from me.",
            "Don't lose hope! Just not that price, not today.",
            "That number's a little short. Want to go another round?",
            "A fun offer! But we're not quite dancing to the same tune—{item} stays with me.",
            "You insult both me and the {item} with that offer.",
            "No deal. Try again with a real number.",
            "That's not even worth my time. Next!",
            "Nice try — come back when you're serious.",
            "Do I look like I'm desperate?",
            "You'll have to do better than that.",
            "Not worth the spit it took to say it."
        ],
        "Neutral": [
            "I can't accept {customer_offer} for {item}.",
            "That's below what I'm asking. Let's move on.",
            "Sorry, {item} is worth more than that.",
            "That offer won't work for me.",
            "Too low. Try again if you're serious.",
            "Not quite the number I had in mind for {item}.",
            "We're not aligned on price. I'll pass.",
            "No deal at {customer_offer}.",
            "This isn't a fair price for {item}.",
            "I'm declining that offer.",
            "Let's not waste time. That's a no.",
            "I'll have to reject that price.",
            "We're not in the same range.",
            "That won't cut it.",
            "Not enough for {item}.",
            "That's below my minimum.",
            "I'm not interested at that price.",
            "That number doesn't work.",
            "That's not going to do it.",
            "This price is unacceptable.",
            "Not happening for that amount.",
            "I've seen better offers today.",
            "No, thank you.",
            "Declining your offer.",
            "I can't justify that price.",
            "Doesn't match the value of {item}.",
            "Too low for me to agree.",
            "That won't be sufficient.",
            "I'd lose out on that deal.",
            "That's not what {item} is worth.",
            "Not a fair price for either of us.",
            "I'm declining. Let's move on.",
            "That's a pass.",
            "Not going to sell at that price.",
            "I don't think so.",
            "Not quite enough.",
            "That doesn't work for me.",
            "Let's skip that offer.",
            "We won't make a deal with that price.",
            "I'm not taking that number.",
            "That offer is too low.",
            "Unfortunately, I can't accept that.",
            "Too far from what I'm asking.",
            "No deal—try again or walk.",
            "That's not a good enough reason to part with {item}.",
            "No agreement there.",
            "Can't meet you at {customer_offer}.",
            "I'm not accepting that.",
            "That number's not workable.",
            "Let's call that a no.",
            "Please, I run a stall, not a charity.",
            "I said a fair price, not a joke!",
            "Try again, friend. I believe in second chances.",
            "Even a beggar would laugh at that offer.",
            "Let's pretend I didn't hear that number.",
            "I value my wares more than that.",
            "Try again, this time with some honesty."
        ],
        "Annoyed": [
            "You're wasting my time with {customer_offer}.",
            "That's not even close—try again or leave.",
            "Are you serious? {customer_offer} for {item}?",
            "I'm not here to give stuff away.",
            "No. That's an insult to the value of {item}.",
            "Come on, I've got better offers waiting.",
            "That's a joke, right?",
            "I can't believe you'd offer that little.",
            "I'm running a business, not a charity.",
            "I'm not selling {item} for scraps.",
            "That offer's an embarrassment.",
            "Don't waste my breath with offers like that.",
            "Absolutely not. Don't lowball me again.",
            "I've had enough of these kinds of offers.",
            "That number is laughable.",
            "Take your {customer_offer} and go.",
            "I should charge you just for asking that.",
            "This is not a flea circus. Try a real offer.",
            "I don't have time for jokes.",
            "Get serious or get lost.",
            "That's your idea of negotiation? Please.",
            "Not even in your dreams is that enough.",
            "Save us both the time—no.",
            "You clearly don't value {item}.",
            "Try again when you respect the craft.",
            "That's not even worth thinking about.",
            "I've seen better offers from children.",
            "Nope. Out of the question.",
            "You're testing my patience now.",
            "Do I look like a fool to you?",
            "I don't even want to dignify that with a counter.",
            "That offer's an insult to {item}.",
            "We're done here if that's your offer.",
            "You're not serious, are you?",
            "Don't come here with play money.",
            "That amount is offensive.",
            "My {item} deserves better.",
            "Please. That's just disrespectful.",
            "You can't be offering {customer_offer} and expect results.",
            "That's not a negotiation—that's robbery.",
            "Go try that stunt somewhere else.",
            "I've been lowballed before, but that's a new low.",
            "That number's an insult to your own intelligence.",
            "I'm not interested in being mocked today.",
            "You're wasting your breath—and mine.",
            "I'd rather break {item} than sell it for that.",
            "Try again. Or don't.",
            "That number should be illegal.",
            "I've had it with these kinds of offers.",
            "Either get real or get gone.",
            "Even the rats wouldn't accept that coin.",
            "You're haggling, not robbing. Show some respect.",
            "No, no, no — that won't do at all.",
            "I've sold to goats with more sense.",
            "Do you always bargain with pebbles?",
            "That's not an offer — that's an insult!",
            "The price stands firm, friend."
        ],
        "Outraged": [
            "You dare offer me {customer_offer} for {item}? Outrageous!",
            "That's not an offer—that's a declaration of war!",
            "You insult my craft with such a pathetic number!",
            "Get out! I won't be robbed in broad daylight!",
            "Do I look like some fool to you?!",
            "That {customer_offer} wouldn't buy the wrapping of {item}!",
            "Unbelievable. You mock me with this?",
            "I should report you for attempted theft!",
            "You dishonor the value of honest work!",
            "This is sacred merchandise, not garbage!",
            "Have you lost your senses?!",
            "I'd rather throw {item} in the river!",
            "You think I worked for that measly offer?!",
            "Your offer is an offense to this entire market!",
            "Such disrespect will not be tolerated!",
            "I ought to have you banned from here!",
            "I wouldn't sell you dust for {customer_offer}!",
            "Shame on you! That's not how we do business!",
            "Begone! Before I lose my temper further!",
            "I won't be swindled by amateurs!",
            "If that's your game, you're in the wrong market!",
            "What do you take me for, a beggar?!",
            "That's not a bargain, it's an insult!",
            "You just spat in the face of tradition!",
            "This is fine craftsmanship, not roadside junk!",
            "You dare toss pennies for treasure?",
            "You've got some nerve!",
            "For {customer_offer}? Go try the junk heap!",
            "You're not welcome with offers like that.",
            "Try cheating someone else, thief!",
            "Your wallet's too small for {item}, clearly!",
            "Get out of my stall!",
            "I should call the guard!",
            "What a disgrace of a negotiation!",
            "You don't deserve to even touch {item}!",
            "I'd sell to rats before I sell to you!",
            "You clearly have no respect for artisanship!",
            "How dare you bring that offer to me!",
            "Don't return unless you learn how to haggle!",
            "This isn't a game, it's my livelihood!",
            "Don't come back with numbers like that!",
            "You mock me, and you mock this market!",
            "You'll find no deals here for crooks!",
            "I'd burn {item} before selling it for {customer_offer}!",
            "You offend me and everyone who made this!",
            "Even a pirate would offer more!",
            "Go steal from someone else!",
            "What gall! What sheer, ignorant gall!",
            "You've wasted my time and patience!",
            "You're banned from my stall!",
            "At that price? I'd rather keep it.",
            "That offer's as empty as your purse.",
            "That's beneath even a thief's honor.",
            "I respect the effort, but no.",
            "If I accepted that, I'd be out of business.",
            "I won't be cheated — not today.",
            "Do you think I found this in the gutter?"
        ]
    },
    "Goodbye": {
        "SunshineAndRainbows": [
            "Take care now, friend! May your pouch stay full!",
            "Farewell, and may your day be as bright as your spirit!",
            "Come back soon—I'll keep something special just for you!",
            "A joy to see you, as always! Safe travels!",
            "May your path be paved with silver and song!",
            "Goodbye for now, and may fortune smile upon you!",
            "Till next time! The market shines a little brighter with you around!",
            "Leave with a smile, and return with stories!",
            "Parting is sweet sorrow—do visit again!",
            "You've been a delight! See you next time!",
            "Walk in peace, and shop in prosperity!",
            "May your days be full of laughter and great bargains!",
            "It was lovely chatting! Drop by any time!",
            "I'll be waiting with fresh wares and old tales!",
            "Off you go, shining star of the market!",
            "You've made my day brighter—thank you!",
            "Take the sun with you, and leave the gloom behind!",
            "May your feet be swift and your purse never empty!",
            "The stall always feels warmer after a visit from you!",
            "Farewell, my favorite customer!",
            "Blessings on your way! Come haggle again soon!",
            "Thank you for the joy and the jest!",
            "Leave with good spirits and return with grander ones!",
            "You've been a pleasure to haggle with!",
            "Until the wind brings you back to me!",
            "Every goodbye brings us closer to the next hello!",
            "You've got a good heart—and a sharp tongue!",
            "Walk well, and return well-stocked!",
            "I'll keep your usual {item} ready next time!",
            "May your dreams be half as bright as your smile!",
            "It's always springtime when you're around!",
            "The market sings when you arrive!",
            "You're welcome back any time, my friend!",
            "Goodbye, and may your coins jingle merrily!",
            "Don't stay away too long—we'll miss your charm!",
            "Wishing you fine weather and even finer deals!",
            "Happiness follow you like a loyal hound!",
            "Even if you didn't buy, you brightened my day!",
            "Let the stars guide your next bargain!",
            "We'll meet again, under a fairer sun!",
            "Go gently, and return loudly!",
            "Don't be a stranger—be a regular!",
            "Farewell, sparkle-heart! Don't lose your shine!",
            "I'll sweep the stall just for your return!",
            "Your laughter still lingers here!",
            "Goodbye, my jolly gem!",
            "Take a piece of this joy with you!",
            "You made this stall a happier place today!",
            "Off to brighten another market, are you?",
            "Until next time, keep your spirit high and your offers higher!",
            "May your new {item} bring you good fortune!",
            "A pleasure doing business with you. Come again!",
            "You've made a wise choice. Safe travels, friend!",
            "For you? I'll throw in a story to go with the {item}.",
            "I wasn't prepared for generosity. You've humbled me.",
            "That's enough to repaint my stall. You're a blessing.",
            "You've made this market day a success before noon!"
        ],
        "Happy": [
            "Good doing business with you! Come by again soon!",
            "Hope to see you back here before the week's out!",
            "That was a fine exchange. Farewell for now!",
            "You made my day a bit better. Take care!",
            "A pleasure! Let's haggle again soon!",
            "Thanks for stopping by! Don't be a stranger!",
            "Always glad to see a friendly face!",
            "Safe travels, friend! My stall will be here!",
            "Come back any time—I'll have more treasures waiting!",
            "Enjoy your new {item}! You've earned it!",
            "You haggle well—respect where it's due!",
            "That went smoother than most! Farewell!",
            "You've got an eye for quality. See you again!",
            "You're welcome back any day of the week!",
            "Good deals, good laughs! That's the market spirit!",
            "I'll remember this sale. It was a good one!",
            "Stop by again, I might have something special for you!",
            "Glad we could find common ground. Farewell!",
            "Take care out there! Markets are tough without your wit!",
            "Here's to fair trades and friendly faces!",
            "You handled yourself well. That earns respect.",
            "Happy to have done business with you!",
            "May your journey be light and your pockets heavy!",
            "Don't be gone too long, I'll miss your charm!",
            "Come again soon—I'll keep the stall warm for you!",
            "You've got great taste. I'll remember that!",
            "That was a fun exchange. Let's do it again sometime!",
            "You made the deal feel fair. I like that!",
            "Safe steps and shrewd haggles to you!",
            "You're always welcome here, friend!",
            "Another happy customer leaves the stall!",
            "You walk away with more than just {item}, I hope—maybe a little joy too!",
            "All the best! Come back when you need more surprises!",
            "Glad we got to a deal—some don't!",
            "Nice bartering with someone who knows the game!",
            "This stall's better with folks like you around!",
            "One of the smoother haggles today! Thanks!",
            "You're good at this! Don't let it go to your head!",
            "Well traded, well parted!",
            "May the next deal be just as fair!",
            "A fair offer and a fine fellow. Farewell!",
            "I hope you enjoy the {item}—it deserves a good home!",
            "We'll haggle again, I can feel it!",
            "Leave happy, and return happier!",
            "Deal's done, smile's earned!",
            "Off you go, friend! The next buyer awaits!",
            "Another day, another good deal!",
            "You helped my stall shine today!",
            "That kind of exchange keeps the market alive!",
            "I'll count this as one of the better sales today!",
            "Take care of that {item}, it deserves a good home.",
            "Until next time! I'll keep an eye out for more treasures for you.",
            "Hope to see you again soon! I'll have new wares waiting.",
            "By the gods, you could have offered less — but I won't stop you.",
            "I don't know whether to thank you or adopt you!",
            "Well, I'm not arguing. That'll do nicely.",
            "That's... more than generous. You have a noble soul."
        ],
        "Neutral": [
            "Farewell. Perhaps we'll cross paths again.",
            "Thanks for stopping by. Have a decent day.",
            "See you around.",
            "Take care. The market waits for no one.",
            "We made it through. Farewell.",
            "Move along. I've got more to do.",
            "You're free to go. I'll be here.",
            "Goodbye.",
            "Nothing more to haggle. Goodbye.",
            "That's all for now. Goodbye.",
            "Safe travels, if that's your thing.",
            "You can leave, I suppose.",
            "I've seen worse deals. Goodbye.",
            "Go on, then. Bye.",
            "Don't let the crowd swallow you whole.",
            "Next time, bring a better coin purse.",
            "Come back if you need something else.",
            "I've got more to sell. You've got more to spend. See you.",
            "You did alright. See you next time.",
            "Maybe next time we'll talk longer.",
            "You haggled fine. Not great. Just fine.",
            "Could've been worse. Could've been better. Bye.",
            "Thanks, I guess. Goodbye.",
            "You're not the worst customer I've seen.",
            "No hard feelings. Business is business.",
            "You're free to go. So go.",
            "We're done here. Farewell.",
            "I've got other customers to tend to.",
            "May your coin return someday.",
            "You might come back. Or not.",
            "That's the end of it. Bye.",
            "Move on.",
            "Not bad. Not memorable, either.",
            "See you again, or don't. Either way.",
            "I'll be here. Same place, same stall.",
            "Our paths might cross again. Who knows.",
            "Right. That's that. Goodbye."
        ],
        "Annoyed": [
            "Finally, it's over. Don't come back too soon.",
            "This stall isn't a charity, remember that.",
            "That haggling was painful. Goodbye.",
            "Next time, don't waste so much of my time.",
            "If I see you coming again, I might hide.",
            "You drive a hard bargain—too hard.",
            "Great. Now scram.",
            "What a chore that was.",
            "You've exhausted my patience. Goodbye.",
            "Be gone now.",
            "I've got better things to do than argue all day.",
            "Don't expect a warm welcome next time.",
            "It's called haggling, not harassment.",
            "I could've made five easier sales by now.",
            "Now I've got an headache because of you, great. Bye.",
            "I'm going to need a break after this.",
            "Are we done? Good.",
            "Just… go already.",
            "Don't try that again with someone else.",
            "I'm not sure you even know how to haggle.",
            "We're done here. Finally.",
            "This stall isn't a place for drama.",
            "If that was your idea of bargaining, yikes.",
            "We're both worse off for that deal.",
            "Not worth the trouble, but sure. Goodbye.",
            "You've got no shame, haggling like that.",
            "The market doesn't need your kind of energy.",
            "Please don't advertise this interaction.",
            "I'll be charging extra just for your face next time.",
            "That was exhausting. Go away.",
            "Hoping I never see your coin again.",
            "If I wanted drama, I'd sell potions.",
            "Try being reasonable next time.",
            "I don't get paid enough for this.",
            "Next time, I'll triple my price for you.",
            "Great... more gray hairs thanks to you.",
            "I've got customers who actually pay fairly.",
            "You drained me more than the heat does.",
            "Get lost.",
            "Honestly, I should've walked away first.",
            "This stall is cursed now, thanks.",
            "Let's never speak of this again.",
            "The market waits for no one. Good day.",
            "I have other customers waiting. Goodbye."
        ],
        "Outraged": [
            "Get out of my stall and don't come back!",
            "You've wasted my time and insulted my trade!",
            "I'd rather throw the {item} in the fire than deal with you again!",
            "Your kind ruins marketplaces!",
            "Take your cursed coins and leave!",
            "You call that a negotiation? Pathetic!",
            "Never darken my stand again!",
            "You insult me and my wares—leave!",
            "You should be banned from every market!",
            "Don't think I won't remember your face!",
            "Next time I'll charge triple for the headache!",
            "You've got no respect for the art of haggling!",
            "This was theft, plain and simple!",
            "I don't deal with swindlers like you!",
            "You're lucky I didn't throw you out sooner!",
            "Begone, pest!",
            "Don't even look in my direction again!",
            "I'll ward this stall just to keep you away!",
            "You're banned! B-A-N-N-E-D!",
            "You insult the very fabric of this market!",
            "You grind my gears worse than broken scales!",
            "I ought to report you to the guild!",
            "Next time you'll find an empty stall!",
            "May your coin pouch always be empty!",
            "Don't expect kindness twice!",
            "I've never dealt with a more miserable customer!",
            "You ruined my morning, my day, and my mood!",
            "You're what's wrong with trade these days!",
            "You think this is a joke? Out!",
            "Try your tricks elsewhere, charlatan!",
            "You're poison to honest merchants!",
            "A curse upon your next bartering attempt!",
            "You'll get no more words from me—go!",
            "My patience was a gift. You spat on it!",
            "You think you're clever? You're disgraceful!",
            "Even thieves have more honor!",
            "I can't stand the sight of you!",
            "You don't deserve market prices!",
            "You've made a mockery of my livelihood!",
            "A storm's calmer than dealing with you!",
            "If I see you again, I'll raise prices out of spite!",
            "Just thinking about you is making my blood boil!",
            "You and your coin are dead to this stall!",
            "Next time, bring more coin or less attitude.",
            "I hope you find what you're looking for... elsewhere.",
            "Good day. I have real customers to attend to."
        ]
    }
}